b = int(input("Введите первый элеиент"))  #  Введите первый элемент
q = int(input("Введите множитель прогрессии"))  #  Введите множитель прогрессии
n = int(input("Ведите номер последнего элемента"))  #Вводим номер последнего элемента
if b>= -10000 and b<= 10000 and q<=50 and q>=1  and n>=2 and n<=100:  # пишем условия для переменных 
    print("Сумма геометрической прогрессии:", (b*(1-q**n))/(1-q))   #вывод суммы
else:
    print("Ошибка в переменной") #выводим ошибку, если переменная не соответствует условию 
    