n= int(input('Введите число: '))    #Ввод с клавиатуры  исходных данных 
a = 0            #Введем счетчик
while n!=0:     #Запуск цикла 
    if n%3==0:     #Условие если число можно поделить на 3 без остатка
            n= n-3    #Выполняется
            a +=1      #Cчетчик увеличивается
    elif n%3==1:      #Условие если число можно поделить на 3 с остатком 1
        n= n-1      #Выполняется
        a+=1     #Cчетчик увеличивается
    elif n%3==2:     #Условие если число можно поделить на 3 с остатком 2
        n=n-2         #Выполняется
        a+=1         #Cчетчик увеличивается
print(a)        #Вывод счетчика